<!DOCTYPE html>
<!-- Generated by Apache Maven Doxia Site Renderer 1.9.1 at 2025-02-20 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>

    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
    <meta name="description" content="Parisjug Java Day">
    <meta name="author" content="">
    <link rel="stylesheet" href="css/main.css" />
    <link rel="stylesheet" href="css/site.css" />

    <title>JavaDay &#x2013; Les Orateurs</title>
                    <meta http-equiv="Content-Language" content="en" />
            
         
  </head>

 
</head>
<body class="composite">

	<!-- Header -->
    <header id="header" class="alt">
        <!--
            <div class="logo"><a href="https://javaday.parisjug.org" style="height: 122px;" ><img src="images/javaday2022.svg" /></a></div>
        -->
        <a href="#menu">&#x2630; Menu</a>
    </header>

<nav id="menu">
    <!-- start -->
                       <div class="navbar-header">
          <a class="navbar-brand" href="/index.html">&#x2630; Java Day</a>
        </div>
        <div id="navbar" class="navbar-collapse collapse">
                  <ul class="nav navbar-nav links">
                  <li>
                          <a href="schedule.html" title="Le programme">Le programme</a>
            </li>
                  <li>
            <strong>Les orateurs</strong>
          </li>
                  <li>
                          <a href="register.html" title="S'enregistrer">S'enregistrer</a>
            </li>
                  <li>
                          <a href="the-team.html" title="L'équipe">L'équipe</a>
            </li>
                  <li>
                          <a href="lieu.html" title="Le lieu">Le lieu</a>
            </li>
                  <li>
                          <a href="contact.html" title="Contact">Contact</a>
            </li>
          </ul>
          <!-- end -->
</nav>

    <section id="banner">
        <div class="inner">
            <header>
			<h1>Paris JUG - Java Day</h1>
            <h2>05 Juin 2025</h2>
		</div>
    </section>
    
    
<div id="main">
    
    <div id="contentBox">
        <h1>Les Orateurs</h1><p> <a href="index.html">L’accueil</a> | <a href="schedule.html">Le programme</a> | <a href="speakers.html">Les orateurs</a> | <a href="register.html">S’enregistrer</a> | <a href="the-team.html">L’équipe</a> | <a href="lieu.html">Le lieu</a></p>


<p>Vous pouvez retrouver la liste compl&#xe8;te de nos speakers sur cette page. Vous pouvez <a class="externalLink" href="https://www.helloasso.com/associations/bjpc/evenements/paris-jug-s-java-day-2025">r&#xe9;server vos places sur cette page</a>.</p><!--
Vous pouvez également vous inscrire par la formation professionnelle, grâce à [OXiane](https://www.oxiane.com/), notre partenaire formation pour cet événement.

Les détails du parcours pédagogique se trouvent ici : <https://www.oxiane.com/parcours-pedagogique-javaday-2025/>. Vous pouvez prendre contact avec OXiane à l'adresse suivante : [formation@oxiane.com](mailto:formation@oxiane.com).
-->

<p><a name="jean-michel" id="jean-michel">&#xa0;</a></p><section>
<h2><a name="Du_JDK_21_au_JDK_25_par_Jean-Michel_Doudoux"></a>Du JDK 21 au JDK 25 par Jean-Michel Doudoux</h2><section>
<h3><a name="R.C3.A9sum.C3.A9"></a>R&#xe9;sum&#xe9;</h3>
<p>La prochaine version LTS du JDK sera diffus&#xe9;e en septembre prochain. Cette pr&#xe9;sentation brosse une revue des principales fonctionnalit&#xe9;s propos&#xe9;es dans cette version 25 LTS du JDK : - nouvelles issues de projets d&#x2019;OpenJDK (Amber, Loom, Panama, Leyden) - dans API de Java Core qui ne font pas l&#x2019;objet de JEP - dans la JVM HotSpot - relatives &#xe0; la s&#xe9;curit&#xe9; - et celles d&#xe9;pr&#xe9;ci&#xe9;es ou supprim&#xe9;es</p></section><section>
<h3><a name="Jean-Michel_Doudoux"></a>Jean-Michel Doudoux</h3>
<p><img src="images/speakers/jmdoudoux.jpg" alt="Jean-Michel Doudoux" /></p>
<p>Passionn&#xe9; par le d&#xe9;veloppement de logiciels et par la veille technologique, je poss&#xe8;de une longue exp&#xe9;rience, en SSII/ESN et personnelle, dans l&#x2019;&#xe9;criture d&#x2019;applications avec diff&#xe9;rents langages. Je suis actuellement Senior tech lead pour la soci&#xe9;t&#xe9; Sciam. Utilisant Java depuis sa version 1.0, j&#x2019;aime partager ma passion pour cette plateforme et son &#xe9;cosyst&#xe8;me notamment en me consacrant, depuis presque vingt ann&#xe9;es, &#xe0; la r&#xe9;daction de deux tutoriels, intitul&#xe9;s &#x201c;D&#xe9;veloppons en Java&#x201d;, diffus&#xe9;s sous licence GNU FDL. Ce travail m&#x2019;a permis d&#x2019;&#xea;tre nomm&#xe9; Java Champion. Je suis &#xe9;galement un des cofondateurs du Lorraine JUG.</p>
<p><a name="charles" id="charles">&#xa0;</a></p></section></section><section>
<h2><a name="R.C3.A9duisez_l.E2.80.99en-t.C3.AAte_des_objets_Java_en_m.C3.A9moire_avec_Java_Lilliput"></a>R&#xe9;duisez l&#x2019;en-t&#xea;te des objets Java en m&#xe9;moire avec Java Lilliput</h2><section>
<h3><a name="R.C3.A9sum.C3.A9"></a>R&#xe9;sum&#xe9;</h3>
<p>L&#x2019;en-t&#xea;te de chaque objet Java en m&#xe9;moire utilise 96 octets, par fois m&#xea;me 128, ce qui, pour une instance d&#x2019;Integer qui transporte un entier sur 32 bits n&#x2019;est pas n&#xe9;gligeable. Le v&#xe9;hicule est beaucoup plus lourd que le chargement, ce qui n&#x2019;est pas tr&#xe8;s efficace ! Cette consommation importante a un impact non seulement sur la m&#xe9;moire qu&#x2019;une application Java a besoin, mais &#xe9;galement sur les traitements, car elle augmente le travail des garbage collectors. L&#x2019;objet du projet Lilliput est de r&#xe9;duire cet en-t&#xea;te &#xe0; 64 octets, en r&#xe9;visant les m&#xe9;canismes de gestion des objets en m&#xe9;moire. L&#x2019;objectif est de r&#xe9;duire l&#x2019;empreinte m&#xe9;moire et d&#x2019;all&#xe9;ger le travail des garbage collectors, ce qui aura un impact sur la consommation du temps CPU. Nous parlerons pointeurs, adressage d&#x2019;objets, fonctionnement des garbage collectors, allocation m&#xe9;moire, organisation des objets en m&#xe9;moire, et dresserons l&#x2019;&#xe9;tat des lieux de ce projet.</p></section><section>
<h3><a name="Charles_Sabourdin"></a>Charles Sabourdin</h3>
<p><img src="images/speakers/Charles-Sabourdin.jpg" alt="Charles Sabourdin" /></p>
<p><a name="jean-vincent" id="jean-vincent">&#xa0;</a></p></section></section><section>
<h2><a name="De_Grails_et_Groovy_.C3.A0_Micronaut_et_Java.2C_carnet_de_bord_d.E2.80.99une_longue_migration"></a>De Grails et Groovy &#xe0; Micronaut et Java, carnet de bord d&#x2019;une longue migration</h2><section>
<h3><a name="R.C3.A9sum.C3.A9"></a>R&#xe9;sum&#xe9;</h3>
<p>Agorapulse a initialement b&#xe2;ti sa plateforme sur le framework Grails, qui permettait un d&#xe9;veloppement rapide avec une petite &#xe9;quipe. Avec la croissances des &#xe9;quipes, l&#x2019;essor des single-page-apps et des architectures microservices, ses limites sont devenues &#xe9;videntes. Le lancement de Micronaut puis l&#x2019;int&#xe9;gration de Micronaut dans la version 4 du framework Grails ont marqu&#xe9; un tournant, permettant une transition progressive depuis Grails. De nos premi&#xe8;res fonctions AWS Lambda utilisant Micronaut 1.0.0.M1 en 2018 &#xe0; l&#x2019;extinction de nos derni&#xe8;res applications Grails en 2025, le r&#xe9;cit de 7 ans d&#x2019;une migration tr&#xe8;s progressive.</p></section><section>
<h3><a name="Jean-Vincent_Drean"></a>Jean-Vincent Drean</h3>
<p><img src="images/speakers/Jean-Vincent-Drean.jpg" alt="Jean-Vincent Drean" /></p>
<p>Au cours des 20 derni&#xe8;res ann&#xe9;es, Jean-Vincent a principalement travaill&#xe9; autour des technologies Java et Web, d&#x2019;abord en contribuant au d&#xe9;veloppement d&#x2019;XWiki un wiki Open-Source &#xe9;crit en Java, puis chez Agorapulse ou l&#x2019;&#xe9;cosyst&#xe8;me Java est omnipr&#xe9;sent.</p>
<p><a name="emmanuel-clement" id="emmanuel-clement">&#xa0;</a></p></section></section><section>
<h2><a name="Quarkus:_philosophie.2C_pragmatisme_et_innovation"></a>Quarkus: philosophie, pragmatisme et innovation</h2>
<p>Cl&#xe9;ment Escoffier et Emmanuel Bernard, co-lead et ex-co-lead du projet Quarkus, vous pr&#xe9;senteront les derni&#xe8;res &#xe9;volutions et futures innovations de Quarkus. Apr&#xe8;s une br&#xe8;ve description de la philosophie et des principes fondamentaux qui guident ce framework, nous explorerons les avanc&#xe9;es r&#xe9;centes et la mani&#xe8;re dont ces innovations &#xe9;mergent.</p>
<p>Nous aborderons des sujets cl&#xe9;s tels que :</p>
<ul>

<li>Le nouveau mod&#xe8;le d&#x2019;ex&#xe9;cution avec les threads virtuels</li>
<li>L&#x2019;int&#xe9;gration de l&#x2019;intelligence artificielle dans les applications</li>
<li>Les &#xe9;volutions en mati&#xe8;re d&#x2019;observabilit&#xe9;</li>
<li>Les am&#xe9;liorations de l&#x2019;exp&#xe9;rience d&#xe9;veloppeur</li>
</ul><section>
<h3><a name="Emmanuel_Bernard"></a>Emmanuel Bernard</h3>
<p><img src="images/speakers/Emmanuel-Bernard.jpg" alt="Emmanuel Bernard" /></p></section><section>
<h3><a name="Cl.C3.A9ment_Escoffier"></a>Cl&#xe9;ment Escoffier</h3>
<p><img src="images/speakers/Clement-Escoffier.jpg" alt="Clément Escoffier" /></p>
<p><a name="ana-maria" id="ana-maria">&#xa0;</a></p></section></section><section>
<h2><a name="S.C3.A9curiser_les_Applications_Java_Contre_les_Menaces_Quantiques"></a>S&#xe9;curiser les Applications Java Contre les Menaces Quantiques</h2><section>
<h3><a name="R.C3.A9sum.C3.A9"></a>R&#xe9;sum&#xe9;</h3>
<p>Alors que nous sommes tous enthousiastes devant le futur heureux que nous promettent les ordinateurs quantiques, que se passerait-il si une telle puissance de calcul &#xe9;tait utilis&#xe9;e pour compromettre les algorithmes cryptographiques qui s&#xe9;curisent les donn&#xe9;es et les communications actuelles ? M&#xea;me si le Y2Q ou le Q-Day semblent lointains, des acteurs malveillants volent d&#xe9;j&#xe0; des donn&#xe9;es crypt&#xe9;es actuellement illisibles dans l&#x2019;espoir de pouvoir les d&#xe9;crypter &#xe0; l&#x2019;avenir. Les applications Java peuvent r&#xe9;sister aux attaques classiques et quantiques en adoptant le chiffrement &#xe0; cl&#xe9; publique hybride (Hybrid Public Key Encryption - HPKE), une nouvelle norme qui utilise le m&#xe9;canisme d&#x2019;encapsulation cl&#xe9; (Key Encapsulation Mechanism - KEM) asym&#xe9;trique, la fonction de d&#xe9;rivation de cl&#xe9; (KDF) et le chiffrement authentifi&#xe9; avec donn&#xe9;es suppl&#xe9;mentaires (AEAD). Cet expos&#xe9; montre le lien entre ces concepts, leur impl&#xe9;mentation dans la s&#xe9;curit&#xe9; du JDK et explique comment ceux-ci peuvent &#xea;tre int&#xe9;gr&#xe9;s pour transmettre des messages s&#xe9;curis&#xe9;s &#xe0; r&#xe9;sistance quantique en Java. &#xc0; la fin de cet pr&#xe9;sentation, vous comprendrez comment utiliser des capacit&#xe9;s de s&#xe9;curit&#xe9; et de la cha&#xee;ne d&#x2019;outils du JDK (keytool, jfr) pour renforcer votre application et r&#xe9;sister aux menaces de l&#x2019;&#xe8;re quantique.</p></section><section>
<h3><a name="Ana-Maria_Mihalceanu"></a>Ana-Maria Mihalceanu</h3>
<p><img src="images/speakers/Ana-Maria-Mihalceanu.jpg" alt="Ana-Maria Mihalceanu" /></p>
<p>Ana est Java Champion, Senior Developer Advocate dans l&#x2019;&#xe9;quipe Java Platform Group chez Oracle, avec une forte exp&#xe9;rience en Java et d&#xe9;veloppement Cloud. Elle contribue &#xe9;galement &#xe0; de nombreux &#xe9;v&#xe9;nements Java. Elle a acquis son exp&#xe9;rience dans l&#x2019;utilisation du JDK, de ses fonctionnalit&#xe9;s avanc&#xe9;es et de son outillage en se confrontant aux r&#xe9;alit&#xe9;s des applications Java et de leurs frameworks en production.</p>
<p><a name="remi" id="remi">&#xa0;</a></p></section></section><section>
<h2><a name="Les_3_paradigmes_d.E2.80.99organisation_du_code_en_Java_et_Claude"></a>Les 3 paradigmes d&#x2019;organisation du code en Java et Claude</h2><section>
<h3><a name="R.C3.A9sum.C3.A9"></a>R&#xe9;sum&#xe9;</h3>
<p>Depuis Java 21, Java a 3 fa&#xe7;on diff&#xe9;rentes d&#x2019;organiser son code si l&#x2019;on veut faire diff&#xe9;rente calculs sur des donn&#xe9;es, la programmation orient&#xe9; objet (OOP), la programmation orient&#xe9; donn&#xe9;es (DOP) et la programmation fonctionnelle (FP). Et prenant comme exemple, l&#x2019;implantation d&#x2019;une petite partie de la comande sed (le s/foo/bar) et avec l&#x2019;aide plus ou moins efficace de Mr Claude Sonnet (fameux LLM et grand mage), je vous propose d&#x2019;expliquer comment en Java organiser son code suivant ces 3 paradigmes et de discuter de leurs avantages et incov&#xe9;nient.</p></section><section>
<h3><a name="R.C3.A9mi_Forax"></a>R&#xe9;mi Forax</h3>
<p><img src="images/speakers/Remi-Forax.jpg" alt="Rémi Forax" /></p>
<p>Java Plombier, Ma&#xee;tre de Conf&#xe9;rence, Virtual Machine Whisperer, martyrise ses pauvres &#xe9;tudiants, complexifie Java en &#xe9;tant expert pour les JSR 292, 335 et 376, d&#xe9;veloppe des librairies et langage dynamiques open source utilis&#xe9;s ou pas.</p></section></section>
    </div>
</div>
<div class="clear">
    <hr/>
</div>
 <footer class="footer">
      <div class="container">
      <span class="">
                       <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/maven-logo-black-on-white.svg" />
      </a>
             </span>
       <span >
        Copyright &#169;                   2025.
          All rights reserved.
       </span> | 
       <span>    
                 <span id="publishDate">Last Published: 2025-02-20</span>
              &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
            </span>
        <img src="https://mirrors.creativecommons.org/presskit/buttons/88x31/png/by-nc.eu.png" style="width: 40px;">
      </div>
       <div class="container">
      <span class="">inspired from <a href="http://templated.co">templated.co</a><span><br />
      </div>
      <hr/>
    </footer>
    
      <!-- Scripts -->
            <script src="https://cdnjs.cloudflare.com/ajax/libs/custom-elements/1.4.2/custom-elements.min.js"></script>
			<script defer src='js/wc-carousel-lite.js'></script>
            <script src="js/jquery.min.js"></script>
			<script src="js/jquery.scrolly.min.js"></script>
			<script src="js/jquery.scrollex.min.js"></script>
			<script src="js/skel.min.js"></script>
			<script src="js/util.js"></script>
			<script src="js/main.js"></script>
            <!-- Global site tag (gtag.js) - Google Analytics -->
            <script async src="https://www.googletagmanager.com/gtag/js?id=UA-151943734-1"></script>
            <script>
                window.dataLayer = window.dataLayer || [];
                function gtag(){dataLayer.push(arguments);}
                gtag('js', new Date());

                gtag('config', 'UA-151943734-1');
            </script>
  
			
</body>


</html>
