<!DOCTYPE html>
<!-- Generated by Apache Maven Doxia Site Renderer 1.9.1 at 2024-03-28 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>

    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
    <meta name="description" content="Parisjug Java Day">
    <meta name="author" content="">
    <link rel="stylesheet" href="css/main.css" />
    <link rel="stylesheet" href="css/site.css" />

    <title>JavaDay &#x2013; Les Orateurs</title>
                    <meta http-equiv="Content-Language" content="en" />
            
         
  </head>

 
</head>
<body class="composite">

	<!-- Header -->
    <header id="header" class="alt">
        <!--
            <div class="logo"><a href="https://javaday.parisjug.org" style="height: 122px;" ><img src="images/javaday2022.svg" /></a></div>
        -->
        <a href="#menu">&#x2630; Menu</a>
    </header>

<nav id="menu">
    <!-- start -->
                       <div class="navbar-header">
          <a class="navbar-brand" href="/index.html">&#x2630; Java Day</a>
        </div>
        <div id="navbar" class="navbar-collapse collapse">
                  <ul class="nav navbar-nav links">
                  <li>
                          <a href="../schedule.html" title="Le programme">Le programme</a>
            </li>
                  <li>
                          <a href="../speakers.html" title="Les orateurs">Les orateurs</a>
            </li>
                  <li>
                          <a href="../register.html" title="S'enregistrer">S'enregistrer</a>
            </li>
                  <li>
                          <a href="../the-team.html" title="L'équipe">L'équipe</a>
            </li>
                  <li>
                          <a href="../lieu.html" title="Le lieu">Le lieu</a>
            </li>
                  <li>
                          <a href="../contact.html" title="Contact">Contact</a>
            </li>
          </ul>
          <!-- end -->
</nav>

    <section id="banner">
        <div class="inner">
            <header>
			<h1>Paris JUG - Java Day</h1>
            <h2>06 Juin 2024</h2>
		</div>
    </section>
    
    
<div id="main">
    
    <div id="contentBox">
        <h1>Les Orateurs</h1>
<p><a href="index.html">L&#x2019;accueil</a> | <a href="schedule.html">Le programme</a> | <b>Les orateurs</b> | <a href="hackergarten.html">hackergarten</a> | <a href="register.html">S&#x2019;enregistrer</a> | <a href="the-team.html">L&#x2019;&#xe9;quipe</a> | <a href="lieu.html">Le lieu</a></p>
<p>Vous pouvez retrouver la liste compl&#xe8;te de nos speakers sur cette page. Vous pouvez <a class="externalLink" href="https://www.helloasso.com/associations/bjpc/evenements/paris-jug-s-java-day">r&#xe9;server vos places sur cette page</a>.</p>
<p>Vous pouvez &#xe9;galement vous inscrire par la formation professionnelle, gr&#xe2;ce &#xe0; <a class="externalLink" href="https://www.oxiane.com/">OXiane</a>, notre partenaire formation pour cet &#xe9;v&#xe9;nement.</p>
<p>Les d&#xe9;tails du parcours p&#xe9;dagogique se trouvent ici : <a class="externalLink" href="https://www.oxiane.com/parcours-pedagogique-javaday-2022/">https://www.oxiane.com/parcours-pedagogique-javaday-2022/</a>. Vous pouvez prendre contact avec OXiane &#xe0; l&#x2019;adresse suivante : <a class="externalLink" href="mailto:formation@oxiane.com">formation@oxiane.com</a>.</p>
<p><a name="jean-michel" id="jean-michel">&#xa0;</a></p><section>
<h2><a name="Java_en_2022_:_profiter_de_Java_17_par_Jean-Michel_Doudoux"></a>Java en 2022 : profiter de Java 17 par Jean-Michel Doudoux</h2><section>
<h3><a name="R.C3.A9sum.C3.A9"></a>R&#xe9;sum&#xe9;</h3>
<p>Beaucoup d&#x2019;applications utilisent encore Java 8 mais Java a beaucoup &#xe9;volu&#xe9; depuis notamment avec la diffusion de deux versions LTS.</p>
<p>L&#x2019;objectif de cette pr&#xe9;sentation est de revenir sur certaines de ces nombreuses &#xe9;volutions de Java, notamment r&#xe9;centes afin d&#x2019;en profiter dans nos applications. Au-del&#xe0; des &#xe9;volutions syntaxiques et dans les API, ce sera aussi l&#x2019;occasion de justifier la migration vers des versions plus r&#xe9;centes de Java.</p></section><section>
<h3><a name="Jean-Michel_Doudoux"></a>Jean-Michel Doudoux</h3>
<p><img src="images/speakers/jmdoudoux.jpg" alt="Jean-Michel Doudoux" /></p>
<p>Passionn&#xe9; par le d&#xe9;veloppement de logiciels et par la veille technologique, je poss&#xe8;de une longue exp&#xe9;rience, en SSII/ESN et personnelle, dans l&#x2019;&#xe9;criture d&#x2019;applications avec diff&#xe9;rents langages. Je suis actuellement le CTO d&#x2019;Oxiane Luxembourg et du groupe Oxiane. Utilisant Java depuis sa version 1.0, j&#x2019;aime partager ma passion pour cette plateforme et son &#xe9;cosyst&#xe8;me notamment en me consacrant, depuis une vingtaine d&#x2019;ann&#xe9;es, &#xe0; la r&#xe9;daction de deux tutoriels, intitul&#xe9;s &#x201c;D&#xe9;veloppons en Java&#x201d;, diffus&#xe9;s sous licence GNU FDL. Ce travail m&#x2019;a permis d&#x2019;&#xea;tre nomm&#xe9; Java Champion. Je suis &#xe9;galement un des cofondateurs du Lorraine JUG.</p>
<p><a name="cedric" id="cedric">&#xa0;</a></p></section></section><section>
<h2><a name="Micronaut_AOT_pour_optimiser_vos_applications_pour_le_JIT_et_GraalVM_par_C.C3.A9dric_Champeau"></a>Micronaut AOT pour optimiser vos applications pour le JIT et GraalVM par C&#xe9;dric Champeau</h2><section>
<h3><a name="R.C3.A9sum.C3.A9"></a>R&#xe9;sum&#xe9;</h3>
<p>Micronaut est un framework Java moderne, multi-facettes, permettant de d&#xe9;velopper aussi bien des applications Java en ligne de commande que des microservices. Il est con&#xe7;u pour maximiser la productivit&#xe9; du d&#xe9;veloppeur, sans compromettre les performances. Dans ce contexte, Micronaut propose depuis le premier jour des optimisations faites &#xe0; <i>build time</i> plut&#xf4;t qu&#x2019;au <i>run time</i>. En particulier, Micronaut n&#x2019;utilise pas de <i>reflection</i>: ceci le rend particuli&#xe8;rement adapt&#xe9; &#xe0; son utilisation avec GraalVM pour la compilation d&#x2019;images natives.</p></section><section>
<h3><a name="C.C3.A9dric_Champeau"></a>C&#xe9;dric Champeau</h3>
<p><img src="images/speakers/cedric-champeau_red.jpg" alt="Cédric Champeau" /></p>
<p>C&#xe9;dric Champeau est d&#xe9;veloppeur Java chez Oracle Labs, dans l&#x2019;&#xe9;quipe Micronaut et GraalVM. Il travaille notamment sur les probl&#xe9;matiques d&#x2019;optimisation de la productivit&#xe9; d&#xe9;veloppeur (aussi bien interne que pour les utilisateurs de Micronaut) et maintient notamment les plugins Gradle et Maven de Micronaut et de GraalVM native-image. Avant cel&#xe0;, C&#xe9;dric a pass&#xe9; plusieurs ann&#xe9;es &#xe0; travailler chez Gradle Inc sur l&#x2019;outil de build open source Gradle, o&#xf9; il a notamment contribu&#xe9; &#xe0; de nombreuses am&#xe9;liorations en termes de performance, gestion des d&#xe9;pendances et s&#xe9;curit&#xe9;. Enfin, C&#xe9;dric a longtemps &#xe9;t&#xe9; un des contributeurs principaux du langage Groovy, pour lequel il a notamment d&#xe9;velopp&#xe9; le compilateur statique et des outils d&#x2019;optimisations &#xe0; compile time (AST transformations).</p>
<p><a name="charles" id="charles">&#xa0;</a></p></section></section><section>
<h2><a name="S.C3.A9curit.C3.A9_en_Java_17_:_les_nouveaut.C3.A9s_pass.C3.A9es_et_.C3.A0_venir"></a>S&#xe9;curit&#xe9; en Java 17 : les nouveaut&#xe9;s pass&#xe9;es et &#xe0; venir</h2>
<p>En plus de plusieurs nouveaut&#xe9;s syntaxiques tr&#xe8;s int&#xe9;ressantes, Java 17 apporte quelques &#xe9;volutions dans le domaine de la s&#xe9;curit&#xe9;, que l&#x2019;on se propose de couvrir dans cette pr&#xe9;sentation. Notre bon vieux SecurityManager est d&#xe9;pr&#xe9;ci&#xe9;, et va &#xea;tre retir&#xe9;. Quelques &#xe9;l&#xe9;ments sont ajout&#xe9;s en cryptographie. La d&#xe9;serialization voit sa s&#xe9;curit&#xe9; am&#xe9;lior&#xe9;e avec les Record et les filtres de d&#xe9;serialization. Les types scell&#xe9;s sont introduits, qui permettent de contr&#xf4;ler la fa&#xe7;on dont on peut &#xe9;tendre une hi&#xe9;rarchie d&#x2019;interfaces et de classes.</p><section>
<h3><a name="Charles_Sabourdin"></a>Charles Sabourdin</h3>
<p><img src="images/speakers/charles-sabourdin.jpg" alt="Charles Sabourdin" /></p>
<p>Investi depuis longtemps dans l&#x2019;informatique, Linuxiens, Javaiste et visc&#xe9;ralement DevOps-ien, Charles Sabourdin est architecte ind&#xe9;pendant, Jug Leader du ParisJUG de 2013 &#xe0; 2020. Il reprend du service en 2022, pour continuer &#xe0; partager avec la communaut&#xe9;.</p>
<p>Il est r&#xe9;guli&#xe8;rement charg&#xe9; de probl&#xe9;matiques d&#x2019;architecture, de s&#xe9;curit&#xe9; et de production. Il travaille sur de nombreux sujets tous ayant un but commun: l&#x2019;am&#xe9;lioration du processus de delivery et l&#x2019;exp&#xe9;rience utilisateur.</p>
<p>En 2021, il co-ecrit un livre ur la haute-disponibilit&#xe9; (Kubernetes) et se focalise sur les operators kubernetes.</p>
<p><a name="brice-jean-philippe" id="brice-jean-philippe">&#xa0;</a></p></section></section><section>
<h2><a name="Rem.C3.A8des_aux_oomkill.2C_warm-ups.2C_et_lenteurs_pour_des_conteneurs_JVM"></a>Rem&#xe8;des aux oomkill, warm-ups, et lenteurs pour des conteneurs JVM</h2>
<p>Mes conteneurs JVM sont en prod, oups ils se font oomkill, oups le d&#xe9;marrage tra&#xee;ne en longueur, oups ils sont lent en permanence. Nous avons v&#xe9;cu ces situations. Ces probl&#xe8;mes &#xe9;mergent parce qu&#x2019;un conteneur est par nature un milieu restreint. Sa configuration a un impact sur le process Java cependant ce process a lui aussi des besoins pour fonctionner. Il y a un espace entre la heap Java et le RSS : c&#x2019;est la m&#xe9;moire off-heap et elle se d&#xe9;compose en plusieurs zones. &#xc0; quoi servent-elles ? Comment les prendre en compte ? La configuration du CPU impacte la JVM sur divers aspects : Quelles sont les influences entre le GC et le CPU ? Que choisir entre la rapidit&#xe9; ou la consommation CPU au d&#xe9;marrage ? Au cours de cette session nous verrons comment diagnostiquer, comprendre et rem&#xe9;dier &#xe0; ces probl&#xe8;mes.</p><section>
<h3><a name="Brice_Dutheil"></a>Brice Dutheil</h3>
<p><img src="images/speakers/Brice_Dutheil_red.jpg" alt="Brice Dutheil" /></p>
<p>Ing&#xe9;nieur logiciel senior Java chez Datadog, Depuis 15 ans j&#x2019;exploite la JVM en tant que d&#xe9;veloppeur de libraries (notamment en ayant &#xe9;t&#xe9; le 2&#xe8;me contributeur principal de Mockito), en tant que consommateur de libraries en tant qu&#x2019;ops (configuration et tuning de JVM sur du Docker, k8s, helm, cpu quota, oomkill, GCs, JFR, async-profiler, pmap). Ayant surv&#xe9;cu &#xe0; l&#x2019;immobilisme de JEE, je surveille et promeut avec engouement le travail des ing&#xe9;nieurs du JDK (ZGC, Shenendoah, Loom, Panama, Valhalla, CRaC, Leyden&#x2026;) ainsi que les avanc&#xe9;s de l&#x2019;&#xe9;cosyst&#xe8;me Java (GraalVM, etc).</p></section><section>
<h3><a name="Jean-Philippe_Bempel"></a>Jean-Philippe Bempel</h3>
<p><img src="images/speakers/jean-philippe-bempel.jpg" alt="Jean-Philippe Bempel" /></p>
<p>D&#xe9;veloppeur passionn&#xe9; par les performances, les runtimes (JVM, CLR) et adepte de Mechanical Sympathy, Jean-Philippe Bempel a plus de 8 ans d&#x2019;exp&#xe9;rience dans les syst&#xe8;mes de trading low latency. Apr&#xe8;s avoir optimis&#xe9; les resources de larges clusters (2000+ noeuds) chez Criteo, Il a int&#xe9;gr&#xe9; l&#x2019;&#xe9;quipe Profiling de Datadog et contribue &#xe0; Java Mission Control.</p>
<p><a name="remi" id="remi">&#xa0;</a></p></section></section><section>
<h2><a name="Valhalla:_Vers_de_nouveaux_generics_universels_et_specialisables"></a>Valhalla: Vers de nouveaux generics universels et specialisables</h2>
<p>Dans le cadre du projet de l&#x2019;OpenJDK Valhalla, nous allons introduire une nouvelle sorte de classe &#xe0; Java (nomm&#xe9;e &#x201c;value class&#x201d;) qui permet de manipuler des objets directement sans pointeur.</p>
<p>Ce nouveau type d&#x2019;objet pose un l&#xe9;ger probl&#xe8;me technique: ils ne marche pas avec les types param&#xe9;tr&#xe9;s de Java, les fameux generics, tout comme les types primitifs d&#x2019;ailleurs, qui sont eux aussi manipul&#xe9;s sans pointeur.</p>
<p>Dans cette pr&#xe9;sentation, je vous propose de regarder de plus pr&#xe8;s quels cela pose exactement et comment nous nous proposons de les r&#xe9;soudre dans la machine virtuelle Java.</p>
<p>La cerise sur le g&#xe2;teau est que si on se d&#xe9;brouille bien, la VM devrait aussi pouvoir supporter les ArrayList&lt;int&gt;.</p><section>
<h3><a name="R.C3.A9mi_Forax"></a>R&#xe9;mi Forax</h3>
<p><img src="images/speakers/Remi-Forax.jpg" alt="Rémi Forax" /></p>
<p>Java Plombier, Ma&#xee;tre de Conf&#xe9;rence, Virtual Machine Whisperer, martyrise ses pauvres &#xe9;tudiants, complexifie Java en &#xe9;tant expert pour les JSR 292, 335 et 376, d&#xe9;veloppe des librariries et langage dynamiques open source utilis&#xe9;s ou pas.</p>
<p><a name="herve" id="herve">&#xa0;</a></p></section></section><section>
<h2><a name="De_Maven_3_.C3.A0_Maven_5"></a>De Maven 3 &#xe0; Maven 5</h2>
<p>Apr&#xe8;s plus de 10 ans de bons et loyaux services, il va &#xea;tre temps de dire au revoir &#xe0; Maven 3 et bonjour &#xe0; Maven 5 : pourquoi un tel saut ? Et comment cela va-t&#x2019;il se passer avec des initiatives telles que wrapper, daemon, build cache et autres moins connus ?</p><section>
<h3><a name="Herv.C3.A9_Boutemy"></a>Herv&#xe9; Boutemy</h3>
<p><img src="images/speakers/Herve-Boutemy.jpg" alt="Hervé Boutemy" /></p>
<p>Herv&#xe9; est Committer Maven depuis 2007, Maven PMC Chair de 2014 &#xe0; 2016. Il est membre de la Fondation Apache depuis 2011, Apache Community Development, actuel VP Apache Attic.</p></section></section>
    </div>
</div>
<div class="clear">
    <hr/>
</div>
 <footer class="footer">
      <div class="container">
      <span class="">
                       <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="../images/maven-logo-black-on-white.svg" />
      </a>
             </span>
       <span >
        Copyright &#169;                   2024.
          All rights reserved.
       </span> | 
       <span>    
                 <span id="publishDate">Last Published: 2024-03-28</span>
              &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
            </span>
        <img src="https://mirrors.creativecommons.org/presskit/buttons/88x31/png/by-nc.eu.png" style="width: 40px;">
      </div>
       <div class="container">
      <span class="">inspired from <a href="http://templated.co">templated.co</a><span><br />
      </div>
      <hr/>
    </footer>
    
      <!-- Scripts -->
            <script src="https://cdnjs.cloudflare.com/ajax/libs/custom-elements/1.4.2/custom-elements.min.js"></script>
			<script defer src='js/wc-carousel-lite.js'></script>
            <script src="js/jquery.min.js"></script>
			<script src="js/jquery.scrolly.min.js"></script>
			<script src="js/jquery.scrollex.min.js"></script>
			<script src="js/skel.min.js"></script>
			<script src="js/util.js"></script>
			<script src="js/main.js"></script>
            <!-- Global site tag (gtag.js) - Google Analytics -->
            <script async src="https://www.googletagmanager.com/gtag/js?id=UA-151943734-1"></script>
            <script>
                window.dataLayer = window.dataLayer || [];
                function gtag(){dataLayer.push(arguments);}
                gtag('js', new Date());

                gtag('config', 'UA-151943734-1');
            </script>
  
			
</body>


</html>
